[
    {
        "title": "How To Buy Treasury Securities",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Investors can't redeem Treasuries purchased on TreasuryDirect before maturity. To sell them, individuals must transfer securities to a broker and then sell them on the secondary market through that broker. If investors seek guidance from a financial advisor to buy Treasuries for their retirement account, the advisor is subject to the Retirement Security Rule, which makes them a fiduciary and requires that they act in the best interest of their clients. The rule, which was set to take effect in September 2024, is currently on hold due to litigation. Investors buy short-term Treasury bills on TreasuryDirect, the U.S. government's portal for buying U.S. Treasuries. Short-term Treasury bills can be bought and sold through a bank or broker. The maximum amount of Treasury bills that one can buy in a single auction is $10 million if the bids are noncompetitive, or 35% of the offering amount for competitive bids. Individuals can buy Canadian Treasury bills from a financial institution or a broker. The minimum investment for purchasing a Canadian Treasury bill is CA$1,000.",
        "url": "https://www.investopedia.com/articles/bonds/08/treasuries-fed.asp"
    },
    {
        "title": "Understanding Interest Rates, Inflation, and Bonds",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "At the July 2023 FOMC meeting, the Fed announced it was raising the federal funds rate by 0.25%, moving its target range to 5.25%-5.50%. The Fed expects to continue raising rates in order to bring down inflation. As a result, the 10-year Treasury is hovering roughly around 4%. Nominal interest rates are the stated rates, while real rates adjust for inflation. Real rates provide a more accurate picture of borrowing costs and investment returns by accounting for the erosion of purchasing power. Bond prices and interest rates have an inverse relationship. When interest rates rise, newly issued bonds offer higher yields, making existing lower-yielding bonds less attractive, which decreases their prices. The yield curve illustrates the relationship between bond yields and their maturities. A normal curve slopes upward, indicating higher yields for longer maturities. Inverted or flat curves can signal economic uncertainty or impending recession. This curve helps shape communicate future expectations about global economies. Investors can diversify their portfolios to include assets like stocks, commodities, and inflation-protected securities to mitigate the impact of interest rate changes and inflation on their investments. If you're specifically interested in hedging your investment portfolio against high or increasing interest rates, consider discussing this investment decision with your financial advisor.",
        "url": "https://www.investopedia.com/articles/bonds/09/bond-market-interest-rates.asp"
    },
    {
        "title": "Why Companies Issue Bonds",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Callable bonds are more complex investments than normal bonds. They may not be appropriate for risk-averse investors seeking a steady stream of income. Corporate bonds are issued by corporations to raise money for funding business needs. Government bonds are issued by governments to fund the government's needs, such as to pay for infrastructure projects, government employee salaries, and other programs. Corporate bonds are generally riskier than government bonds as most governments are less likely to fail than corporations. Because of this risk, corporate bonds generally provide better returns. Generally, yes, corporate bonds are safer than stocks. Corporate bonds offer a fixed rate of return, so an investor knows exactly how much their investment will return. Stocks, however, typically offer a better rate of return because they are riskier. So the money invested in a corporate bond, while it may earn 3%, might also miss out on earning more if the stock appreciates more than 3%; however, the stock also may not appreciate more than 3%. The right investment depends on the investor's risk tolerance and investment objectives. No, corporate bonds are not tax-free. An investor will have to pay taxes on the interest income earned as well as on any capital gains.",
        "url": "https://www.investopedia.com/articles/investing/062813/why-companies-issue-bonds.asp"
    },
    {
        "title": "Hedge Your Bets With Inflation-Indexed Bonds",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Fitch Ratings downgraded the rating for the U.S. from AAA to AA+ in Aug. 2023. The credit rating agency stated that concerns about the country's \"fiscal deterioration\" over the next three years and its high national debt caused by tax cuts and increased government spending were among the reasons for the drop. Inflation-linked bonds are fixed-income assets that are designed to protect investors from inflation. Generally offered by federal governments, these assets are indexed to inflation. This means they are tied to inflation so the principal investment and interest portion both rise and fall with the inflation rate. In many cases, they are tied to the price index of consumer goods and services. For instance, those issued by the U.S. government are tied to the Consumer Price Index. Bonds that are linked to inflation are usually offered by federal governments. These fixed-income investments offer investors protection against inflation because they are indexed to inflation. As such, the principal and interest rises and falls with the inflation rate. Although they provide some safety, there are certain risks associated with inflation-linked bonds. For instance, investors are subject to interest rate risk. They must also consider deflation risk since these bonds are tied to the CPI in the U.S. The current rate for I bonds issued between May 1, 2023, and Oct. 31, 2023, is 4.30%. This rate includes a fixed rate of 0.90%.",
        "url": "https://www.investopedia.com/articles/bonds/09/inflation-linked-bonds.asp"
    },
    {
        "title": "The Impact of an Inverted Yield Curve",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Two economic theories have been used to explain the shape of the yield curve; the pure expectations theory and the liquidity preference theory. The yield curve inverted on March 31, 2022, when the two-year yield rose above the 10-year yield. The inversion followed shortly after the Federal Open Markets Committee began raising the target federal funds rate to control inflation. The trend peaked in July 2023 after a series of interest rate hikes by the Federal Reserve. An inverted yield curve in U.S. Treasuries has predicted every recession since 1955, with only one false signal during that time. It even \"predicted\" the economic downturn that followed the COVID-19 pandemic (although most economists attribute this to luck, and not the fact that it can predict natural disasters).",
        "url": "https://www.investopedia.com/articles/basics/06/invertedyieldcurve.asp"
    },
    {
        "title": "Understanding Bond Prices and Yields",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Bond prices and bond yields are excellent indicators of the economy as a whole, and of inflation in particular. As bond prices shift, you can reverse engineer market expectations about interest rates and future market expectations. Bond price and bond yield are inversely related. As the price of a bond goes up, the yield decreases. As the price of a bond goes down, the yield increases. This is because the coupon rate of the bond remains fixed, so the price in secondary markets often fluctuates to align with prevailing market rates. A bond's coupon is the stated payment awarded to the investor, usually paid on a bi-annual basis. This fixed rate never changes, and the payment amount never changes. Alternatively, a bond's yield is the rate of return when discounting all cash flows at prevailing market rates and considering changes in a bond's price. At issuance, a bond's yield will equal the coupon rate if the bond was issued at par value. When interest rates across the market go up, there will be more investment options offering higher interest rates. A bond that issues 3% coupon payments may now be \"outdated\" if interest rates have increased to 5%. To compensate for this, the bond will be sold at a discount in secondary market. Although the coupon rate will remain 3%, the lower price of the bond means the investor will earn a higher yield. It depends. If you're an investor looking to enter a bond investment via secondary markets, you'll likely be able to buy a bond at a discount. If you're holding onto an older bond and its yield is increasing, this means the price has gone down from what you paid for it. However, you'll still earn the coupon rate from your initial investment. In addition, high yields are directionally related to the risk of the bond. You may be able to secure a very high yield for a junk bond, but this doesn't mean it's a good investment. In general, higher yields reflect greater risk for bonds. For risk-adverse investors looking for safer investments, a lower yield may actually be preferable.",
        "url": "https://www.investopedia.com/articles/bonds/07/price_yield.asp"
    },
    {
        "title": "Time to Cash in Your U.S. Savings Bonds?",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": " No U.S. savings bonds can be transferred, sold, or traded to another party. You can cash in most paper bonds (with some exceptions) at your bank or credit union. You can cash in electronic bonds online with TreasuryDirect, which will send the cash from the bond to your savings or checking account within two business days. There are some bonds that you cannot cash at your bank, including HH Series Savings Bonds. To cash in your EE Savings Bonds, you only have to log into TreasuryDirect and follow their directions. If you are cashing a full or partial amount, it can be sent from TreasuryDirect to your checking or savings account. If you have paper bonds, you can just ask your bank or credit union. Avoiding taxes when you cash out your bonds, depends on a few criteria. For example, Series I Bonds can be used (tax-free) to pay for education costs. Series I Bonds are subject to federal taxes but not state and local taxes. When you purchase Series EE or Series I Bonds you can pay taxes on the interest each year, or you can pay it at the end of its term. Overall, if you cash out bonds, you must pay tax on the interest the bond earns, unless it is used for education or under specific conditions.",
        "url": "https://www.investopedia.com/articles/personal-finance/060614/time-cash-your-us-savings-bonds.asp"
    },
    {
        "title": "An Overview of Perpetual Bonds",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Yale’s Beinecke Rare Book & Manuscript Library has a bond issued by Dutch water authority Stichtse Rijnlanden in 1648, which still pays interest. Steady, predictable source of income with payments on a set schedule Some perpetual bonds increase interest at predetermined points in the future Investors are subject to perpetual credit risk exposure Issuers may be able to recall some perpetual bonds Rising general interest rates could diminish the value of the perpetual bond",
        "url": "https://www.investopedia.com/articles/investing/082313/perpetual-bonds-overview.asp"
    },
    {
        "title": "Top 5 Emerging Market Bond ETFs",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/markets/071315/top-5-emerging-market-bond-etfs.asp"
    },
    {
        "title": "BND vs. AGG: Comparing Bond ETFs",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "The expense ratio for both BND and AGG is 0.03%. Both BND and AGG typically pay dividends on a regular schedule. The frequency can vary but is often monthly or quarterly, as the dividends are earned on the underlying bonds which may have varying or changing payment schedules. Tax implications should be a significant consideration for any ETF investments. BND and AGG can produce taxable income from dividends, and you can also be taxed capital gains taxes upon selling shares. This tax may be assessed at a short-term capital gains rate or long-term capital gains rate. .",
        "url": "https://www.investopedia.com/articles/etfs-mutual-funds/050316/bnd-vs-agg-comparing-bond-etfs.asp"
    },
    {
        "title": "Top 5 Municipal Bond Funds for 2022",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/investing/010716/top-5-municipal-bond-funds-2016.asp"
    },
    {
        "title": "Everything You Need to Know About Junk Bonds",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "You need to know how long you can commit your cash before you decide to buy a junk bond fund. Many do not allow investors to cash out for at least one or two years. The simple reason to buy a junk bond is for higher returns. Junk bonds are risky assets but due to their high risk, they come with returns that are higher than safer, investment-grade bonds. Investors willing to take on higher risk for higher returns would buy junk bonds. The primary disadvantage of a junk bond is the issuer defaulting on the bond. Junk bonds are issued by companies or countries that are low-rated. There is a high chance that the issuer may not be able to make the interest payments on the bond or that they may go bankrupt and not only not make payments but not repurchase the bond at maturity. Junk bonds are bonds that have a rating of BB or lower by S&P or Ba and lower by Moody's. Any bonds with these ratings are junk bonds.",
        "url": "https://www.investopedia.com/articles/02/052202.asp"
    },
    {
        "title": "Fannie Mae and Freddie Mac: An Overview",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "In September 2019, the U.S. Treasury and FHFA announced that Fannie Mae and Freddie Mac could start keeping their earnings to build up their capital reserves. The move was a step toward transitioning the two out of conservatorship. In early 2024, Fannie Mae and Freddie Mac had net worths of $77.7 billion and $47.7 billion, respectively.",
        "url": "https://www.investopedia.com/articles/economics/08/fannie-mae-freddie-mac-credit-crisis.asp"
    },
    {
        "title": "Preferred Stock ETFs vs. Bond ETFs: What's the Difference?",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/investing/041415/preferred-stock-etfs-vs-bond-etfs.asp"
    },
    {
        "title": "5 Best Short-Term Bond Funds for 2020",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/investing/123015/top-5-shortterm-bond-funds-2016.asp"
    },
    {
        "title": "How Bond Market Pricing Works",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/bonds/07/pricing_conventions.asp"
    },
    {
        "title": "Money Market Funds vs. Short-Term Bonds: What's the Difference?",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Lower returns are realized when compared to other investments because of the liquidity of the money market. Most bonds can be bought through a full-service or discount brokerage. Government agencies sell government bonds online and deposit payments electronically. Some financial institutions also transact government securities with their clients. The bond owner could lose money if interest rates go up, in the sense of opportunity cost by having the money tied up in the bond rather than invested elsewhere. Funds that hold a high concentration of government securities are considered by many to be the safest, particularly if they hold Treasuries, which are backed by the government and therefore carry a lesser risk of default. A short-term bond will typically mature within no more than three years. A long-term bond may not mature until after 10 years. The bond's \"coupon\" or interest should be paid out a few times a year in either case. Deciding between them can depend on your goals and whether you're investing for the long-term or to achieve something that's on a closer horizon. Bonds carry more risk than money market funds. A bond's lender may not be able to make interest or principal payments on time, or the bond may be paid off early with the remaining interest payments lost. The bond may be called, paid off, and reissued at a lower rate if interest rates go down, resulting in lost income for the bond owner.",
        "url": "https://www.investopedia.com/articles/investing/041916/money-market-vs-shortterm-bonds-compare-and-contrast-case-study.asp"
    },
    {
        "title": "Top 4 Strategies for Managing a Bond Portfolio",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Bond investing is not as simple or predictable as it might seem to the casual observer. There are many ways to build a bond portfolio and each has its risks and rewards. A bond is essentially an IOU. When a corporation, a government, or some other agency wants to raise a sum of money, it might issue a round of bonds. Investors buy the bonds in return for a set amount of interest, usually paid in installments. When the bond reaches its maturity date, the issuer returns the original sum invested. High-quality bonds represent a reasonably safe alternative for the investor. \"High-quality\" means the bonds come with a rating of BBB- or better from one of the three major bond rating agencies. The return the investor will get is known up front. The rating indicates that the company is extremely likely to pay the interest and return the principal. When inflation rises, the interest rates on newly-issued bonds typically will increase in order to remain competitive. The same trend, however, causes the value of existing bonds to decrease on the secondary bond market. The existing bonds cannot compete with newer, higher-paying bonds. That is why it is often said that bond prices are inversely related to interest rates. Price fluctuations in the secondary bond market have no impact on the value of bonds being held to maturity by investors. An investor is highly unlikely to lose money on bonds as long as the bonds are investment quality, meaning they are rated BBB- or better. That is the reason that investors prize bonds. They provide a steady, reliable income with little chance of a loss of principle. The risk in bonds lies in the potential for missed opportunities. If an investor buys a one-year bond that pays 3.9 percent interest in March and new bonds issued four months later pay 4.3 percent, the investor has missed an opportunity for a better return.",
        "url": "https://www.investopedia.com/articles/bonds/08/bond-portfolio-strategies.asp"
    },
    {
        "title": "Bond Funds vs. Bond ETFs: What's the Difference?",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "All else being equal, ETFs are usually more flexible. However, this flexibility may not be the best case in all situations. For example, retirement funds want stability, so intraday trading flexibility is actually not entirely ideal. Both bond funds and bond ETFs have similarities, though the holdings within the funds and their fees charged to investors can vary. Bond ETFs often have lower expense ratios than bond funds. This is because ETFs have passive management. Bond funds may have higher expenses because of the active management and the costs associated with mutual fund operations. Bond funds may have minimum investment requirements, which can vary widely from fund to fund. Some may have minimum investments of a few thousand dollars. Bond ETFs, on the other hand, usually do not have minimum investment requirements. Yes, both bond funds and bond ETFs can be used to generate income. They both invest in bonds which typically pay periodic interest or coupon payments. Bond ETFs often provide better transparency because they have to disclose their holdings on a daily basis. Investors can see exactly what bonds are held within the ETF. Meanwhile, bond funds often disclose their holdings less frequently, perhaps only disclosing information on a quarterly basis to meet external reporting requirements. Bond ETFs can lose value due to several factors, including changes in interest rates, credit risk, and market sentiment. When interest rates rise, the prices of existing bonds, which have lower interest rates compared to new bonds, tend to fall. Since a bond ETF holds many such bonds, its value can decrease as well. The duration of the ETF's portfolio will tell you how sensitive it is to interest rate changes. Additionally, if the creditworthiness of the bonds within the ETF deteriorates, this can also lead to a decrease in the ETF’s value. It's important to remember that while bond ETFs offer liquidity and the flexibility of trading like stocks, they are not immune to the risks inherent in the bond market. Investing in a bond fund is not necessarily riskier than investing in a bond. If you decide to invest in a bond fund, it is important that you understand what the fund is invested in. Read the fund's stated objectives to ensure that they are in line with your risk profile.",
        "url": "https://www.investopedia.com/articles/investing/041615/pros-cons-bond-funds-vs-bond-etfs.asp"
    },
    {
        "title": "How Does a Eurobond Work?",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "The eurobond is denominated in a foreign currency but launched in a nation with a strong currency. That keeps them highly liquid for their investors.",
        "url": "https://www.investopedia.com/articles/investing/081815/how-does-eurobond-work.asp"
    },
    {
        "title": "Opportunities and Risks of Green Bond Investing",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/investing/081115/green-bonds-benefits-and-risks.asp"
    },
    {
        "title": "Evaluating Bond Funds for Performance and Risks",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "",
        "url": "https://www.investopedia.com/articles/mutualfund/05/062805.asp"
    }
]